webapp/app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "MyString"], ["body", "MyText"], ["created_at", 2016-09-25 22:07:59 UTC], ["updated_at", 2016-09-25 22:07:59 UTC]]
---
  def create
    @article = Article.new(article_params)
    @article.slug = @article.title.parameterize

    if @article.save